#!/bin/bash

set -e

ascii_art=' ▄██████▄    ▄▄▄▄███▄▄▄▄      ▄████████    ▄█   ▄█▄ ███    █▄  ▀█████████▄
███    ███ ▄██▀▀▀███▀▀▀██▄   ███    ███   ███ ▄███▀ ███    ███   ███    ███
███    ███ ███   ███   ███   ███    ███   ███▐██▀   ███    ███   ███    ███
███    ███ ███   ███   ███   ███    ███  ▄█████▀    ███    ███  ▄███▄▄▄██▀
███    ███ ███   ███   ███ ▀███████████ ▀▀█████▄    ███    ███ ▀▀███▀▀▀██▄
███    ███ ███   ███   ███   ███    ███   ███▐██▄   ███    ███   ███    ██▄
███    ███ ███   ███   ███   ███    ███   ███ ▀███▄ ███    ███   ███    ███
 ▀██████▀   ▀█   ███   █▀    ███    █▀    ███   ▀█▀ ████████▀  ▄█████████▀
                                          ▀
'

echo -e "$ascii_art"
echo "=> Omakub is for fresh Ubuntu 24.04+ installations only!"
echo -e "\nBegin installation (or abort with ctrl+c)..."

sudo apt-get update >/dev/null
sudo apt-get install -y git >/dev/null

echo "Cloning Omakub..."
rm -rf ~/.local/share/omakub
git clone https://github.com/olipet284/omakub.git ~/.local/share/omakub >/dev/null
if [[ $OMAKUB_REF != "master" ]]; then
	cd ~/.local/share/omakub
	git fetch origin "${OMAKUB_REF:-stable}" && git checkout "${OMAKUB_REF:-stable}"
	cd -
fi

echo "Installation starting..."
source ~/.local/share/omakub/install.sh
